# Formulae
brew "git"
brew "fzf"
brew "wget"
brew "tree"
brew "stow"
brew "ripgrep"
brew "neovim"
brew "gnupg"
brew "pinentry-mac"
brew "fnm"
brew "go"

# Casks
cask "rectangle"
cask "syncthing"
cask "pika"
cask "domzilla-caffeine"
cask "pearcleaner"
cask "vlc"
cask "the-unarchiver"
cask "keepassxc"
cask "telegram"
cask "visual-studio-code"
cask "brave-browser"
cask "firefox"
cask "figma"
cask "obsidian"
cask "ghostty@tip"
cask "tunnelblick"
cask "transmission"
cask "hammerspoon"

# VSCode extension
vscode "pkief.material-icon-theme"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
