# Formulae
brew "git"
brew "fzf"
brew "wget"
brew "tree"
brew "stow"
brew "ripgrep"
brew "neovim"
brew "gnupg"
brew "pinentry-mac"
brew "fnm"
brew "go"

# Casks
cask "rectangle"
cask "syncthing"
cask "pika"
cask "itsycal"
cask "pearcleaner"
cask "the-unarchiver"
cask "vlc"
cask "keepassxc"
cask "brave-browser"
cask "telegram"
cask "obsidian"
cask "ghostty"
cask "hammerspoon"
