# Formulae
brew "git"
brew "fzf"
brew "tree"
brew "vim"
brew "go"
brew "fnm"
brew "gnupg"
brew "pinentry-mac"

# Casks
cask "rectangle"
cask "syncthing"
cask "pika"
cask "pearcleaner"
cask "domzilla-caffeine"
cask "itsycal"
cask "the-unarchiver"
cask "vlc"
cask "keepassxc"
cask "brave-browser"
cask "telegram"
cask "visual-studio-code"
cask "obsidian"
cask "ghostty"
cask "hammerspoon"

# VSCode extension
vscode "z4yross.anysphere-dark"
vscode "pkief.material-icon-theme"
vscode "usernamehw.errorlens"
vacode "vscodevim.vim"
vscode "esbenp.prettier-vscode"
vscode "johnnymorganz.stylua"
vscode "sumneko.lua"
vscode "golang.go"