# Formulae
brew "git"
brew "fzf"
brew "vim"
brew "tree"
brew "go"
brew "node@22"
brew "gnupg"
brew "pinentry-mac"

# Casks
cask "syncthing"
cask "pika"
cask "pearcleaner"
cask "itsycal"
cask "domzilla-caffeine"
cask "the-unarchiver"
cask "vlc"
cask "keepassxc"
cask "telegram"
cask "brave-browser"
cask "obsidian"
cask "visual-studio-code"
cask "ghostty@tip"

# VSCode extension
vscode "esbenp.prettier-vscode"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "pkief.material-icon-theme"
vscode "usernamehw.errorlens"
