# CLI tools
brew "git"
brew "fzf"
brew "wget"
brew "tree"
brew "gnupg"
brew "neovim", args: ["HEAD"]
brew "ripgrep"
brew "pinentry-mac"
brew "go"
brew "node"
brew "lua-language-server"
brew "stylua"
brew "biome"
brew "shfmt"

# Apps
cask "syncthing-app"
cask "domzilla-caffeine"
cask "pika"
cask "keepassxc"
cask "itsycal"
cask "transmission"
cask "pearcleaner"
cask "the-unarchiver"
cask "vlc"
cask "visual-studio-code"
cask "telegram"
cask "helium-browser"
cask "ghostty"
cask "firefox"
cask "obsidian"
cask "figma"
cask "affinity"

# Fonts
cask "font-source-sans-3"
cask "font-iosevka"

# VS Code Extensions
vscode "pkief.material-icon-theme"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "biomejs.biome"

# Go packages
go "golang.org/x/tools/gopls"

# Mac App Store apps
mas "WireGuard", id: 1451685025
