# Tools
brew "git"
brew "fzf"
brew "tree"
brew "wget"
brew "neovim"
brew "ripgrep"
brew "gnupg"
brew "pinentry-mac"
brew "tree-sitter-cli"

# Runtimes
brew "go"
brew "node"
cask "temurin@25"

# LSPs
brew "lua-language-server"
brew "jdtls"

# Formatters
brew "stylua"
brew "beautysh"
brew "shfmt"
brew "biome"

# Apps
cask "syncthing-app"
cask "domzilla-caffeine"
cask "loop"
cask "transmission"
cask "pearcleaner"
cask "itsycal"
cask "vlc"
cask "pika"
cask "keepassxc"
cask "telegram"
cask "brave-browser"
cask "firefox"
cask "ghostty"
cask "obsidian"
cask "figma"
cask "affinity"

# Fonts
cask "font-source-sans-3"
cask "font-ibm-plex-mono"
cask "font-cascadia-mono"
cask "font-iosevka"
cask "font-hermit"

# Go packages
go "golang.org/x/tools/gopls"

# Mac App Store apps
mas "WireGuard", id: 1451685025
